# Placement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..Placement Property
BaseImportOptions Class See Also
---
Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ImportPlacement Placement { get; set; }
```

Visual Basic
---
```text
Public Property Placement As ImportPlacement
	Get
	Set
```

Visual C++
---
```text
public:
property ImportPlacement Placement {
	ImportPlacement get ();
	void set (ImportPlacement value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace